koshkin-sergey/mbOS/Device/STMicroelectronics/STM32F4xx/CMSIS_Driver/Config/RTE_Device.h
//   <e> DMA Rx
//     <o1> Number <1=>1
//     <i>  Selects DMA Number (only DMA1 can be used)
//     <o2> Stream <1=>1 <4=>4
//     <i>  Selects DMA Stream (only Stream 1 or 4 can be used)
//     <o3> Channel <4=>4 <7=>7
//     <i>  Selects DMA Channel (only Channel 4 or 7 can be used)
//     <o4> Priority <0=>Low <1=>Medium <2=>High <3=>Very High
//     <i>  Selects DMA Priority
//   </e>
#define RTE_USART3_RX_DMA               0
#define RTE_USART3_RX_DMA_NUMBER        1
#define RTE_USART3_RX_DMA_STREAM        1
#define RTE_USART3_RX_DMA_CHANNEL       4
#define RTE_USART3_RX_DMA_PRIORITY      0

//   <e> DMA Tx
//     <o1> Number <1=>1
//     <i>  Selects DMA Number (only DMA1 can be used)
//     <o2> Stream <3=>3 <4=>4
//     <i>  Selects DMA Stream (only Stream 3 or 4 can be used)
//     <o3> Channel <4=>4 <7=>7
//     <i>  Selects DMA Channel (only Channel 4 or 7 can be used)
//     <o4> Priority <0=>Low <1=>Medium <2=>High <3=>Very High
//     <i>  Selects DMA Priority
//   </e>
#define RTE_USART3_TX_DMA               0
#define RTE_USART3_TX_DMA_NUMBER        1
#define RTE_USART3_TX_DMA_STREAM        3
#define RTE_USART3_TX_DMA_CHANNEL       4
#define RTE_USART3_TX_DMA_PRIORITY      0

// </e> USART3 (Universal synchronous asynchronous receiver transmitter) [Driver_USART3]

// <e> UART4 (Universal asynchronous receiver transmitter) [Driver_USART4]
// <i> Configuration settings for Driver_USART4 in component ::CMSIS Driver:USART
#define RTE_UART4                       0

//   <o> UART4_TX Pin <0=>Not Used <1=>PA0 <2=>PC10 <3=>PD10 <4=>PA12 <5=>PD1
#define   RTE_UART4_TX_ID               0
#if      (RTE_UART4_TX_ID == 0)
  #define RTE_UART4_TX                  0
#elif    (RTE_UART4_TX_ID == 1)
  #define RTE_UART4_TX                  1
  #define RTE_UART4_TX_PORT             GPIO_PORT_A
  #define RTE_UART4_TX_PIN              GPIO_PIN_0
  #define RTE_UART4_TX_FUNC             GPIO_PIN_FUNC_8
#elif    (RTE_UART4_TX_ID == 2)
  #define RTE_UART4_TX                  1
  #define RTE_UART4_TX_PORT             GPIO_PORT_C
  #define RTE_UART4_TX_PIN              GPIO_PIN_10
  #define RTE_UART4_TX_FUNC             GPIO_PIN_FUNC_8
#elif    (RTE_UART4_TX_ID == 3)
  #define RTE_UART4_TX                  1
  #define RTE_UART4_TX_PORT             GPIO_PORT_D
  #define RTE_UART4_TX_PIN              GPIO_PIN_10
  #define RTE_UART4_TX_FUNC             GPIO_PIN_FUNC_8
#elif    (RTE_UART4_TX_ID == 4)
  #define RTE_UART4_TX                  1
  #define RTE_UART4_TX_PORT             GPIO_PORT_A
  #define RTE_UART4_TX_PIN              GPIO_PIN_12
  #define RTE_UART4_TX_FUNC             GPIO_PIN_FUNC_11
#elif    (RTE_UART4_TX_ID == 5)
  #define RTE_UART4_TX                  1
  #define RTE_UART4_TX_PORT             GPIO_PORT_D
  #define RTE_UART4_TX_PIN              GPIO_PIN_1
  #define RTE_UART4_TX_FUNC             GPIO_PIN_FUNC_11
#else
  #error "Invalid UART4_TX Pin Configuration!"
#endif

//   <o> UART4_RX Pin <0=>Not Used <1=>PA1 <2=>PC11 <3=>PA11 <4=>PD0
#define   RTE_UART4_RX_ID               0
#if      (RTE_UART4_RX_ID == 0)
  #define RTE_UART4_RX                  0
#elif    (RTE_UART4_RX_ID == 1)
  #define RTE_UART4_RX                  1
  #define RTE_UART4_RX_PORT             GPIO_PORT_A
  #define RTE_UART4_RX_PIN              GPIO_PIN_1
  #define RTE_UART4_RX_FUNC             GPIO_PIN_FUNC_8
#elif    (RTE_UART4_RX_ID == 2)
  #define RTE_UART4_RX                  1
  #define RTE_UART4_RX_PORT             GPIO_PORT_C
  #define RTE_UART4_RX_PIN              GPIO_PIN_11
  #define RTE_UART4_RX_FUNC             GPIO_PIN_FUNC_8
#elif    (RTE_UART4_RX_ID == 3)
  #define RTE_UART4_RX                  1
  #define RTE_UART4_RX_PORT             GPIO_PORT_A
  #define RTE_UART4_RX_PIN              GPIO_PIN_11
  #define RTE_UART4_RX_FUNC             GPIO_PIN_FUNC_11
#elif    (RTE_UART4_RX_ID == 4)
  #define RTE_UART4_RX                  1
  #define RTE_UART4_RX_PORT             GPIO_PORT_D
  #define RTE_UART4_RX_PIN              GPIO_PIN_0
  #define RTE_UART4_RX_FUNC             GPIO_PIN_FUNC_11
#else
  #error "Invalid UART4_RX Pin Configuration!"
#endif

//   <e> DMA Rx
//     <o1> Number <1=>1
//     <i>  Selects DMA Number (only DMA1 can be used)
//     <o2> Stream <2=>2
//     <i>  Selects DMA Stream (only Stream 2 can be used)
//     <o3> Channel <4=>4
//     <i>  Selects DMA Channel (only Channel 4 can be used)
//     <o4> Priority <0=>Low <1=>Medium <2=>High <3=>Very High
//     <i>  Selects DMA Priority
//   </e>
#define RTE_UART4_RX_DMA                0
#define RTE_UART4_RX_DMA_NUMBER         1
#define RTE_UART4_RX_DMA_STREAM         2
#define RTE_UART4_RX_DMA_CHANNEL        4
#define RTE_UART4_RX_DMA_PRIORITY       0

//   <e> DMA Tx
//     <o1> Number <1=>1
//     <i>  Selects DMA Number (only DMA1 can be used)
//     <o2> Stream <4=>4
//     <i>  Selects DMA Stream (only Stream 4 can be used)
//     <o3> Channel <4=>4
//     <i>  Selects DMA Channel (only Channel 4 can be used)
//     <o4> Priority <0=>Low <1=>Medium <2=>High <3=>Very High
//     <i>  Selects DMA Priority
//   </e>
#define RTE_UART4_TX_DMA                0
#define RTE_UART4_TX_DMA_NUMBER         1
#define RTE_UART4_TX_DMA_STREAM         4
#define RTE_UART4_TX_DMA_CHANNEL        4
#define RTE_UART4_TX_DMA_PRIORITY       0

// </e> UART4 (Universal asynchronous receiver transmitter) [Driver_USART4]

// <e> UART5 (Universal asynchronous receiver transmitter) [Driver_USART5]
// <i> Configuration settings for Driver_USART5 in component ::CMSIS Driver:USART
#define RTE_UART5                       0

//   <o> UART5_TX Pin <0=>Not Used <1=>PC12 <2=>PB6 <3=>PB9 <4=>PB13
#define   RTE_UART5_TX_ID               0
#if      (RTE_UART5_TX_ID == 0)
  #define RTE_UART5_TX                  0
#elif    (RTE_UART5_TX_ID == 1)
  #define RTE_UART5_TX                  1
  #define RTE_UART5_TX_PORT             GPIO_PORT_C
  #define RTE_UART5_TX_PIN              GPIO_PIN_12
  #define RTE_UART5_TX_FUNC             GPIO_PIN_FUNC_8
#elif    (RTE_UART5_TX_ID == 2)
  #define RTE_UART5_TX                  1
  #define RTE_UART5_TX_PORT             GPIO_PORT_B
  #define RTE_UART5_TX_PIN              GPIO_PIN_6
  #define RTE_UART5_TX_FUNC             GPIO_PIN_FUNC_11
#elif    (RTE_UART5_TX_ID == 3)
  #define RTE_UART5_TX                  1
  #define RTE_UART5_TX_PORT             GPIO_PORT_B
  #define RTE_UART5_TX_PIN              GPIO_PIN_9
  #define RTE_UART5_TX_FUNC             GPIO_PIN_FUNC_11
#elif    (RTE_UART5_TX_ID == 4)
  #define RTE_UART5_TX                  1
  #define RTE_UART5_TX_PORT             GPIO_PORT_B
  #define RTE_UART5_TX_PIN              GPIO_PIN_13
  #define RTE_UART5_TX_FUNC             GPIO_PIN_FUNC_11
#else
  #error "Invalid UART5_TX Pin Configuration!"
#endif

