koshkin-sergey/mbOS/Device/STMicroelectronics/STM32F4xx/CMSIS_Driver/Config/RTE_Device.h
//   <e> DMA Rx
//     <o1> Number <2=>2
//     <i>  Selects DMA Number (only DMA2 can be used)
//     <o2> Stream <1=>1 <2=>2
//     <i>  Selects DMA Stream (only Stream 1 or 2 can be used)
//     <o3> Channel <5=>5
//     <i>  Selects DMA Channel (only Channel 5 can be used)
//     <o4> Priority <0=>Low <1=>Medium <2=>High <3=>Very High
//     <i>  Selects DMA Priority
//   </e>
#define RTE_USART6_RX_DMA               0
#define RTE_USART6_RX_DMA_NUMBER        2
#define RTE_USART6_RX_DMA_STREAM        1
#define RTE_USART6_RX_DMA_CHANNEL       5
#define RTE_USART6_RX_DMA_PRIORITY      0

//   <e> DMA Tx
//     <o1> Number <2=>2
//     <i>  Selects DMA Number (only DMA2 can be used)
//     <o2> Stream <6=>6 <7=>7
//     <i>  Selects DMA Stream (only Stream 6 or 7 can be used)
//     <o3> Channel <5=>5
//     <i>  Selects DMA Channel (only Channel 5 can be used)
//     <o4> Priority <0=>Low <1=>Medium <2=>High <3=>Very High
//     <i>  Selects DMA Priority
//   </e>
#define RTE_USART6_TX_DMA               0
#define RTE_USART6_TX_DMA_NUMBER        2
#define RTE_USART6_TX_DMA_STREAM        6
#define RTE_USART6_TX_DMA_CHANNEL       5
#define RTE_USART6_TX_DMA_PRIORITY      0

// </e> USART6 (Universal synchronous asynchronous receiver transmitter) [Driver_USART6]

// <e> UART7 (Universal asynchronous receiver transmitter) [Driver_USART7]
// <i> Configuration settings for Driver_USART7 in component ::CMSIS Driver:USART
#define RTE_UART7                       0

//   <o> UART7_TX Pin <0=>Not Used <1=>PF7 <2=>PE8 <3=>PA15 <4=>PB4
#define   RTE_UART7_TX_ID               0
#if      (RTE_UART7_TX_ID == 0)
  #define RTE_UART7_TX                  0
#elif    (RTE_UART7_TX_ID == 1)
  #define RTE_UART7_TX                  1
  #define RTE_UART7_TX_PORT             GPIO_PORT_F
  #define RTE_UART7_TX_PIN              GPIO_PIN_7
  #define RTE_UART7_TX_FUNC             GPIO_PIN_FUNC_8
#elif    (RTE_UART7_TX_ID == 2)
  #define RTE_UART7_TX                  1
  #define RTE_UART7_TX_PORT             GPIO_PORT_E
  #define RTE_UART7_TX_PIN              GPIO_PIN_8
  #define RTE_UART7_TX_FUNC             GPIO_PIN_FUNC_8
#elif    (RTE_UART7_TX_ID == 3)
  #define RTE_UART7_TX                  1
  #define RTE_UART7_TX_PORT             GPIO_PORT_A
  #define RTE_UART7_TX_PIN              GPIO_PIN_15
  #define RTE_UART7_TX_FUNC             GPIO_PIN_FUNC_8
#elif    (RTE_UART7_TX_ID == 4)
  #define RTE_UART7_TX                  1
  #define RTE_UART7_TX_PORT             GPIO_PORT_B
  #define RTE_UART7_TX_PIN              GPIO_PIN_4
  #define RTE_UART7_TX_FUNC             GPIO_PIN_FUNC_8
#else
  #error "Invalid UART7_TX Pin Configuration!"
#endif

//   <o> UART7_RX Pin <0=>Not Used <1=>PF6 <2=>PE7 <3=>PA8 <4=>PB3
#define   RTE_UART7_RX_ID               0
#if      (RTE_UART7_RX_ID == 0)
  #define RTE_UART7_RX                  0
#elif    (RTE_UART7_RX_ID == 1)
  #define RTE_UART7_RX                  1
  #define RTE_UART7_RX_PORT             GPIO_PORT_F
  #define RTE_UART7_RX_PIN              GPIO_PIN_6
  #define RTE_UART7_RX_FUNC             GPIO_PIN_FUNC_8
#elif    (RTE_UART7_RX_ID == 2)
  #define RTE_UART7_RX                  1
  #define RTE_UART7_RX_PORT             GPIO_PORT_E
  #define RTE_UART7_RX_PIN              GPIO_PIN_7
  #define RTE_UART7_RX_FUNC             GPIO_PIN_FUNC_8
#elif    (RTE_UART7_RX_ID == 3)
  #define RTE_UART7_RX                  1
  #define RTE_UART7_RX_PORT             GPIO_PORT_A
  #define RTE_UART7_RX_PIN              GPIO_PIN_8
  #define RTE_UART7_RX_FUNC             GPIO_PIN_FUNC_8
#elif    (RTE_UART7_RX_ID == 4)
  #define RTE_UART7_RX                  1
  #define RTE_UART7_RX_PORT             GPIO_PORT_B
  #define RTE_UART7_RX_PIN              GPIO_PIN_3
  #define RTE_UART7_RX_FUNC             GPIO_PIN_FUNC_8
#else
  #error "Invalid UART7_RX Pin Configuration!"
#endif

//   <e> DMA Rx
//     <o1> Number <1=>1
//     <i>  Selects DMA Number (only DMA1 can be used)
//     <o2> Stream <3=>3
//     <i>  Selects DMA Stream (only Stream 3 can be used)
//     <o3> Channel <5=>5
//     <i>  Selects DMA Channel (only Channel 5 can be used)
//     <o4> Priority <0=>Low <1=>Medium <2=>High <3=>Very High
//     <i>  Selects DMA Priority
//   </e>
#define RTE_UART7_RX_DMA                0
#define RTE_UART7_RX_DMA_NUMBER         1
#define RTE_UART7_RX_DMA_STREAM         3
#define RTE_UART7_RX_DMA_CHANNEL        5
#define RTE_UART7_RX_DMA_PRIORITY       0

//   <e> DMA Tx
//     <o1> Number <1=>1
//     <i>  Selects DMA Number (only DMA1 can be used)
//     <o2> Stream <1=>1
//     <i>  Selects DMA Stream (only Stream 1 can be used)
//     <o3> Channel <5=>5
//     <i>  Selects DMA Channel (only Channel 5 can be used)
//     <o4> Priority <0=>Low <1=>Medium <2=>High <3=>Very High
//     <i>  Selects DMA Priority
//   </e>
#define RTE_UART7_TX_DMA                0
#define RTE_UART7_TX_DMA_NUMBER         1
#define RTE_UART7_TX_DMA_STREAM         1
#define RTE_UART7_TX_DMA_CHANNEL        5
#define RTE_UART7_TX_DMA_PRIORITY       0

// </e> UART7 (Universal asynchronous receiver transmitter) [Driver_USART7]

// <e> UART8 (Universal asynchronous receiver transmitter) [Driver_USART8]
// <i> Configuration settings for Driver_USART8 in component ::CMSIS Driver:USART
#define RTE_UART8                       0

//   <o> UART8_TX Pin <0=>Not Used <1=>PE1 <2=>PF9
#define   RTE_UART8_TX_ID               0
#if      (RTE_UART8_TX_ID == 0)
  #define RTE_UART8_TX                  0
#elif    (RTE_UART8_TX_ID == 1)
  #define RTE_UART8_TX                  1
  #define RTE_UART8_TX_PORT             GPIO_PORT_E
  #define RTE_UART8_TX_PIN              GPIO_PIN_1
  #define RTE_UART8_TX_FUNC             GPIO_PIN_FUNC_8
#elif    (RTE_UART8_TX_ID == 2)
  #define RTE_UART8_TX                  1
  #define RTE_UART8_TX_PORT             GPIO_PORT_F
  #define RTE_UART8_TX_PIN              GPIO_PIN_9
  #define RTE_UART8_TX_FUNC             GPIO_PIN_FUNC_8
#else
  #error "Invalid UART8_TX Pin Configuration!"
#endif

//   <o> UART8_RX Pin <0=>Not Used <1=>PE0 <2=>PF8
#define   RTE_UART8_RX_ID               0
#if      (RTE_UART8_RX_ID == 0)
  #define RTE_UART8_RX                  0
#elif    (RTE_UART8_RX_ID == 1)
  #define RTE_UART8_RX                  1
  #define RTE_UART8_RX_PORT             GPIO_PORT_E
  #define RTE_UART8_RX_PIN              GPIO_PIN_0
  #define RTE_UART8_RX_FUNC             GPIO_PIN_FUNC_8
#elif    (RTE_UART8_RX_ID == 2)
  #define RTE_UART8_RX                  1
  #define RTE_UART8_RX_PORT             GPIO_PORT_F
  #define RTE_UART8_RX_PIN              GPIO_PIN_8
  #define RTE_UART8_RX_FUNC             GPIO_PIN_FUNC_8
#else
  #error "Invalid UART8_RX Pin Configuration!"
#endif

