koshkin-sergey/mbOS/Device/STMicroelectronics/STM32F4xx/CMSIS_Driver/Config/RTE_Device.h
//   <e> DMA Rx
//     <o1> Number <1=>1
//     <i>  Selects DMA Number (only DMA1 can be used)
//     <o2> Stream <6=>6
//     <i>  Selects DMA Stream (only Stream 6 can be used)
//     <o3> Channel <5=>5
//     <i>  Selects DMA Channel (only Channel 5 can be used)
//     <o4> Priority <0=>Low <1=>Medium <2=>High <3=>Very High
//     <i>  Selects DMA Priority
//   </e>
#define RTE_UART8_RX_DMA                0
#define RTE_UART8_RX_DMA_NUMBER         1
#define RTE_UART8_RX_DMA_STREAM         6
#define RTE_UART8_RX_DMA_CHANNEL        5
#define RTE_UART8_RX_DMA_PRIORITY       0

//   <e> DMA Tx
//     <o1> Number <1=>1
//     <i>  Selects DMA Number (only DMA1 can be used)
//     <o2> Stream <0=>0
//     <i>  Selects DMA Stream (only Stream 0 can be used)
//     <o3> Channel <5=>5
//     <i>  Selects DMA Channel (only Channel 5 can be used)
//     <o4> Priority <0=>Low <1=>Medium <2=>High <3=>Very High
//     <i>  Selects DMA Priority
//   </e>
#define RTE_UART8_TX_DMA                0
#define RTE_UART8_TX_DMA_NUMBER         1
#define RTE_UART8_TX_DMA_STREAM         0
#define RTE_UART8_TX_DMA_CHANNEL        5
#define RTE_UART8_TX_DMA_PRIORITY       0

// </e> UART8 (Universal asynchronous receiver transmitter) [Driver_USART8]

// <e> UART9 (Universal asynchronous receiver transmitter) [Driver_USART9]
// <i> Configuration settings for Driver_USART9 in component ::CMSIS Driver:USART
#define RTE_UART9                       0

//   <o> UART9_TX Pin <0=>Not Used <1=>PD15 <2=>PG1
#define   RTE_UART9_TX_ID               0
#if      (RTE_UART9_TX_ID == 0)
  #define RTE_UART9_TX                  0
#elif    (RTE_UART9_TX_ID == 1)
  #define RTE_UART9_TX                  1
  #define RTE_UART9_TX_PORT             GPIO_PORT_D
  #define RTE_UART9_TX_PIN              GPIO_PIN_15
  #define RTE_UART9_TX_FUNC             GPIO_PIN_FUNC_11
#elif    (RTE_UART9_TX_ID == 2)
  #define RTE_UART9_TX                  1
  #define RTE_UART9_TX_PORT             GPIO_PORT_G
  #define RTE_UART9_TX_PIN              GPIO_PIN_1
  #define RTE_UART9_TX_FUNC             GPIO_PIN_FUNC_11
#else
  #error "Invalid UART9_TX Pin Configuration!"
#endif

//   <o> UART9_RX Pin <0=>Not Used <1=>PD14 <2=>PG0
#define   RTE_UART9_RX_ID               0
#if      (RTE_UART9_RX_ID == 0)
  #define RTE_UART9_RX                  0
#elif    (RTE_UART9_RX_ID == 1)
  #define RTE_UART9_RX                  1
  #define RTE_UART9_RX_PORT             GPIO_PORT_D
  #define RTE_UART9_RX_PIN              GPIO_PIN_14
  #define RTE_UART9_RX_FUNC             GPIO_PIN_FUNC_11
#elif    (RTE_UART9_RX_ID == 2)
  #define RTE_UART9_RX                  1
  #define RTE_UART9_RX_PORT             GPIO_PORT_G
  #define RTE_UART9_RX_PIN              GPIO_PIN_0
  #define RTE_UART9_RX_FUNC             GPIO_PIN_FUNC_11
#else
  #error "Invalid UART9_RX Pin Configuration!"
#endif

//   <e> DMA Rx
//     <o1> Number <2=>2
//     <i>  Selects DMA Number (only DMA2 can be used)
//     <o2> Stream <7=>7
//     <i>  Selects DMA Stream (only Stream 7 can be used)
//     <o3> Channel <0=>0
//     <i>  Selects DMA Channel (only Channel 0 can be used)
//     <o4> Priority <0=>Low <1=>Medium <2=>High <3=>Very High
//     <i>  Selects DMA Priority
//   </e>
#define RTE_UART9_RX_DMA                0
#define RTE_UART9_RX_DMA_NUMBER         1
#define RTE_UART9_RX_DMA_STREAM         6
#define RTE_UART9_RX_DMA_CHANNEL        5
#define RTE_UART9_RX_DMA_PRIORITY       0

//   <e> DMA Tx
//     <o1> Number <2=>2
//     <i>  Selects DMA Number (only DMA2 can be used)
//     <o2> Stream <0=>0
//     <i>  Selects DMA Stream (only Stream 0 can be used)
//     <o3> Channel <1=>1
//     <i>  Selects DMA Channel (only Channel 1 can be used)
//     <o4> Priority <0=>Low <1=>Medium <2=>High <3=>Very High
//     <i>  Selects DMA Priority
//   </e>
#define RTE_UART9_TX_DMA                0
#define RTE_UART9_TX_DMA_NUMBER         1
#define RTE_UART9_TX_DMA_STREAM         0
#define RTE_UART9_TX_DMA_CHANNEL        5
#define RTE_UART9_TX_DMA_PRIORITY       0

// </e> UART9 (Universal asynchronous receiver transmitter) [Driver_USART9]

// <e> UART10 (Universal asynchronous receiver transmitter) [Driver_USART10]
// <i> Configuration settings for Driver_USART10 in component ::CMSIS Driver:USART
#define RTE_UART10                      0

//   <o> UART10_TX Pin <0=>Not Used <1=>PE3 <2=>PG12
#define   RTE_UART10_TX_ID              0
#if      (RTE_UART10_TX_ID == 0)
  #define RTE_UART10_TX                 0
#elif    (RTE_UART10_TX_ID == 1)
  #define RTE_UART10_TX                 1
  #define RTE_UART10_TX_PORT            GPIO_PORT_E
  #define RTE_UART10_TX_PIN             GPIO_PIN_3
  #define RTE_UART10_TX_FUNC            GPIO_PIN_FUNC_11
#elif    (RTE_UART10_TX_ID == 2)
  #define RTE_UART10_TX                 1
  #define RTE_UART10_TX_PORT            GPIO_PORT_G
  #define RTE_UART10_TX_PIN             GPIO_PIN_12
  #define RTE_UART10_TX_FUNC            GPIO_PIN_FUNC_11
#else
  #error "Invalid UART10_TX Pin Configuration!"
#endif

//   <o> UART10_RX Pin <0=>Not Used <1=>PE2 <2=>PG11
#define   RTE_UART10_RX_ID              0
#if      (RTE_UART10_RX_ID == 0)
  #define RTE_UART10_RX                 0
#elif    (RTE_UART10_RX_ID == 1)
  #define RTE_UART10_RX                 1
  #define RTE_UART10_RX_PORT            GPIO_PORT_E
  #define RTE_UART10_RX_PIN             GPIO_PIN_2
  #define RTE_UART10_RX_FUNC            GPIO_PIN_FUNC_11
#elif    (RTE_UART10_RX_ID == 2)
  #define RTE_UART10_RX                 1
  #define RTE_UART10_RX_PORT            GPIO_PORT_G
  #define RTE_UART10_RX_PIN             GPIO_PIN_11
  #define RTE_UART10_RX_FUNC            GPIO_PIN_FUNC_11
#else
  #error "Invalid UART10_RX Pin Configuration!"
#endif

//   <e> DMA Rx
//     <o1> Number <2=>2
//     <i>  Selects DMA Number (only DMA1 can be used)
//     <o2> Stream <0=>0 <3=>3
//     <i>  Selects DMA Stream (only Stream 0 or 3 can be used)
//     <o3> Channel <5=>5 <9=>9
//     <i>  Selects DMA Channel (only Channel 5 or 9 can be used)
//     <o4> Priority <0=>Low <1=>Medium <2=>High <3=>Very High
//     <i>  Selects DMA Priority
//   </e>
#define RTE_UART10_RX_DMA               0
#define RTE_UART10_RX_DMA_NUMBER        1
#define RTE_UART10_RX_DMA_STREAM        6
#define RTE_UART10_RX_DMA_CHANNEL       5
#define RTE_UART10_RX_DMA_PRIORITY      0

//   <e> DMA Tx
//     <o1> Number <2=>2
//     <i>  Selects DMA Number (only DMA1 can be used)
//     <o2> Stream <7=>7 <3=>5
//     <i>  Selects DMA Stream (only Stream 7 or 5 can be used)
//     <o3> Channel <6=>6 <9=>9
//     <i>  Selects DMA Channel (only Channel 6 or 9 can be used)
//     <o4> Priority <0=>Low <1=>Medium <2=>High <3=>Very High
//     <i>  Selects DMA Priority
//   </e>
#define RTE_UART10_TX_DMA               0
#define RTE_UART10_TX_DMA_NUMBER        1
#define RTE_UART10_TX_DMA_STREAM        0
#define RTE_UART10_TX_DMA_CHANNEL       5
#define RTE_UART10_TX_DMA_PRIORITY      0

