koshkin-sergey/mbOS/Device/STMicroelectronics/STM32F4xx/CMSIS_Driver/Config/RTE_Device.h
//   <e> DMA Rx
//     <o1> Number <2=>2
//     <i>  Selects DMA Number (only DMA2 can be used)
//     <o2> Stream <0=>0 <2=>2
//     <i>  Selects DMA Stream (only Stream 0 or 2 can be used)
//     <o3> Channel <3=>3
//     <i>  Selects DMA Channel (only Channel 3 can be used)
//     <o4> Priority <0=>Low <1=>Medium <2=>High <3=>Very High
//     <i>  Selects DMA Priority
//   </e>
#define RTE_SPI1_RX_DMA                 1
#define RTE_SPI1_RX_DMA_NUMBER          2
#define RTE_SPI1_RX_DMA_STREAM          0
#define RTE_SPI1_RX_DMA_CHANNEL         3
#define RTE_SPI1_RX_DMA_PRIORITY        0

//   <e> DMA Tx
//     <o1> Number <2=>2
//     <i>  Selects DMA Number (only DMA2 can be used)
//     <o2> Stream <3=>3 <5=>5
//     <i>  Selects DMA Stream (only Stream 3 or 5 can be used)
//     <o3> Channel <3=>3
//     <i>  Selects DMA Channel (only Channel 3 can be used)
//     <o4> Priority <0=>Low <1=>Medium <2=>High <3=>Very High
//     <i>  Selects DMA Priority
//   </e>
#define RTE_SPI1_TX_DMA                 1
#define RTE_SPI1_TX_DMA_NUMBER          2
#define RTE_SPI1_TX_DMA_STREAM          5
#define RTE_SPI1_TX_DMA_CHANNEL         3
#define RTE_SPI1_TX_DMA_PRIORITY        0

// </e>

// <e> SPI2 (Serial Peripheral Interface 2) [Driver_SPI2]
// <i> Configuration settings for Driver_SPI2 in component ::CMSIS Driver:SPI
#define RTE_SPI2                        0

//   <o> SPI2_MISO Pin <0=>Not Used <1=>PB14 <2=>PC2 <3=>PI2 <4=>PA12
#define RTE_SPI2_MISO_PORT_ID           0
#if    (RTE_SPI2_MISO_PORT_ID == 0)
  #define RTE_SPI2_MISO                 0
#elif  (RTE_SPI2_MISO_PORT_ID == 1)
  #define RTE_SPI2_MISO                 1
  #define RTE_SPI2_MISO_PORT            GPIO_PORT_B
  #define RTE_SPI2_MISO_PIN             GPIO_PIN_14
  #define RTE_SPI2_MISO_FUNC            GPIO_PIN_FUNC_5
#elif  (RTE_SPI2_MISO_PORT_ID == 2)
  #define RTE_SPI2_MISO                 1
  #define RTE_SPI2_MISO_PORT            GPIO_PORT_C
  #define RTE_SPI2_MISO_PIN             GPIO_PIN_2
  #define RTE_SPI2_MISO_FUNC            GPIO_PIN_FUNC_5
#elif  (RTE_SPI2_MISO_PORT_ID == 3)
  #define RTE_SPI2_MISO                 1
  #define RTE_SPI2_MISO_PORT            GPIO_PORT_I
  #define RTE_SPI2_MISO_PIN             GPIO_PIN_2
  #define RTE_SPI2_MISO_FUNC            GPIO_PIN_FUNC_5
#elif  (RTE_SPI2_MISO_PORT_ID == 4)
  #define RTE_SPI2_MISO                 1
  #define RTE_SPI2_MISO_PORT            GPIO_PORT_A
  #define RTE_SPI2_MISO_PIN             GPIO_PIN_12
  #define RTE_SPI2_MISO_FUNC            GPIO_PIN_FUNC_5
#else
  #error "Invalid SPI2_MISO Pin Configuration!"
#endif

//   <o> SPI2_MOSI Pin <0=>Not Used <1=>PB15 <2=>PC3 <3=>PI3 <4=>PA10
#define RTE_SPI2_MOSI_PORT_ID           0
#if    (RTE_SPI2_MOSI_PORT_ID == 0)
  #define RTE_SPI2_MOSI                 0
#elif  (RTE_SPI2_MOSI_PORT_ID == 1)
  #define RTE_SPI2_MOSI                 1
  #define RTE_SPI2_MOSI_PORT            GPIO_PORT_B
  #define RTE_SPI2_MOSI_PIN             GPIO_PIN_15
  #define RTE_SPI2_MOSI_FUNC            GPIO_PIN_FUNC_5
#elif  (RTE_SPI2_MOSI_PORT_ID == 2)
  #define RTE_SPI2_MOSI                 1
  #define RTE_SPI2_MOSI_PORT            GPIO_PORT_C
  #define RTE_SPI2_MOSI_PIN             GPIO_PIN_3
  #define RTE_SPI2_MOSI_FUNC            GPIO_PIN_FUNC_5
#elif  (RTE_SPI2_MOSI_PORT_ID == 3)
  #define RTE_SPI2_MOSI                 1
  #define RTE_SPI2_MOSI_PORT            GPIO_PORT_I
  #define RTE_SPI2_MOSI_PIN             GPIO_PIN_3
  #define RTE_SPI2_MOSI_FUNC            GPIO_PIN_FUNC_5
#elif  (RTE_SPI2_MOSI_PORT_ID == 4)
  #define RTE_SPI2_MOSI                 1
  #define RTE_SPI2_MOSI_PORT            GPIO_PORT_A
  #define RTE_SPI2_MOSI_PIN             GPIO_PIN_10
  #define RTE_SPI2_MOSI_FUNC            GPIO_PIN_FUNC_5
#else
  #error "Invalid SPI2_MOSI Pin Configuration!"
#endif

//   <o> SPI2_SCK Pin <0=>PB10 <1=>PB13 <2=>PC7 <3=>PD3 <4=>PI1 <5=>PA9
#define RTE_SPI2_SCK_PORT_ID            0
#if    (RTE_SPI2_SCK_PORT_ID == 0)
  #define RTE_SPI2_SCK_PORT             GPIO_PORT_B
  #define RTE_SPI2_SCK_PIN              GPIO_PIN_10
  #define RTE_SPI2_SCK_FUNC             GPIO_PIN_FUNC_5
#elif  (RTE_SPI2_SCK_PORT_ID == 1)
  #define RTE_SPI2_SCK_PORT             GPIO_PORT_B
  #define RTE_SPI2_SCK_PIN              GPIO_PIN_13
  #define RTE_SPI2_SCK_FUNC             GPIO_PIN_FUNC_5
#elif  (RTE_SPI2_SCK_PORT_ID == 2)
  #define RTE_SPI2_SCK_PORT             GPIO_PORT_C
  #define RTE_SPI2_SCK_PIN              GPIO_PIN_7
  #define RTE_SPI2_SCK_FUNC             GPIO_PIN_FUNC_5
#elif  (RTE_SPI2_SCK_PORT_ID == 3)
  #define RTE_SPI2_SCK_PORT             GPIO_PORT_D
  #define RTE_SPI2_SCK_PIN              GPIO_PIN_3
  #define RTE_SPI2_SCK_FUNC             GPIO_PIN_FUNC_5
#elif  (RTE_SPI2_SCK_PORT_ID == 4)
  #define RTE_SPI2_SCK_PORT             GPIO_PORT_I
  #define RTE_SPI2_SCK_PIN              GPIO_PIN_1
  #define RTE_SPI2_SCK_FUNC             GPIO_PIN_FUNC_5
#elif  (RTE_SPI2_SCK_PORT_ID == 5)
  #define RTE_SPI2_SCK_PORT             GPIO_PORT_A
  #define RTE_SPI2_SCK_PIN              GPIO_PIN_9
  #define RTE_SPI2_SCK_FUNC             GPIO_PIN_FUNC_5
#else
  #error "Invalid SPI2_SCK Pin Configuration!"
#endif

//   <o> SPI2_NSS Pin <0=>Not Used <1=>PB9 <2=>PB12 <3=>PI0 <4=>PA11
#define RTE_SPI2_NSS_PORT_ID            0
#if    (RTE_SPI2_NSS_PORT_ID == 0)
  #define RTE_SPI2_NSS                  0
#elif  (RTE_SPI2_NSS_PORT_ID == 1)
  #define RTE_SPI2_NSS                  1
  #define RTE_SPI2_NSS_PORT             GPIO_PORT_B
  #define RTE_SPI2_NSS_PIN              GPIO_PIN_9
  #define RTE_SPI2_NSS_FUNC             GPIO_PIN_FUNC_5
#elif  (RTE_SPI2_NSS_PORT_ID == 2)
  #define RTE_SPI2_NSS                  1
  #define RTE_SPI2_NSS_PORT             GPIO_PORT_B
  #define RTE_SPI2_NSS_PIN              GPIO_PIN_12
  #define RTE_SPI2_NSS_FUNC             GPIO_PIN_FUNC_5
#elif  (RTE_SPI2_NSS_PORT_ID == 3)
  #define RTE_SPI2_NSS                  1
  #define RTE_SPI2_NSS_PORT             GPIO_PORT_I
  #define RTE_SPI2_NSS_PIN              GPIO_PIN_0
  #define RTE_SPI2_NSS_FUNC             GPIO_PIN_FUNC_5
#elif  (RTE_SPI2_NSS_PORT_ID == 4)
  #define RTE_SPI2_NSS                  1
  #define RTE_SPI2_NSS_PORT             GPIO_PORT_A
  #define RTE_SPI2_NSS_PIN              GPIO_PIN_11
  #define RTE_SPI2_NSS_FUNC             GPIO_PIN_FUNC_5
#else
  #error "Invalid SPI2_NSS Pin Configuration!"
#endif

