koshkin-sergey/mbOS/Device/STMicroelectronics/STM32F4xx/CMSIS_Driver/Config/RTE_Device.h
//   <o> SPI4_MISO Pin <0=>Not Used <1=>PA11 <2=>PE5 <3=>PE13
#define RTE_SPI4_MISO_PORT_ID           0
#if    (RTE_SPI4_MISO_PORT_ID == 0)
  #define RTE_SPI4_MISO                 0
#elif  (RTE_SPI4_MISO_PORT_ID == 1)
  #define RTE_SPI4_MISO                 1
  #define RTE_SPI4_MISO_PORT            GPIO_PORT_A
  #define RTE_SPI4_MISO_PIN             GPIO_PIN_11

  #if (defined (STM32F413xx) || defined (STM32F423xx))
    #define RTE_SPI3_MISO_FUNC          GPIO_PIN_FUNC_6
  #else
    #define RTE_SPI3_MISO_FUNC          GPIO_PIN_FUNC_5
  #endif

#elif  (RTE_SPI4_MISO_PORT_ID == 2)
  #define RTE_SPI4_MISO                 1
  #define RTE_SPI4_MISO_PORT            GPIO_PORT_E
  #define RTE_SPI4_MISO_PIN             GPIO_PIN_5
  #define RTE_SPI4_MISO_FUNC            GPIO_PIN_FUNC_5
#elif  (RTE_SPI4_MISO_PORT_ID == 3)
  #define RTE_SPI4_MISO                 1
  #define RTE_SPI4_MISO_PORT            GPIO_PORT_E
  #define RTE_SPI4_MISO_PIN             GPIO_PIN_13
  #define RTE_SPI4_MISO_FUNC            GPIO_PIN_FUNC_5
#else
  #error "Invalid SPI4_MISO Pin Configuration!"
#endif

//   <o> SPI4_MOSI Pin <0=>Not Used <1=>PA1 <2=>PE6 <3=>PE14
#define RTE_SPI4_MOSI_PORT_ID           0
#if    (RTE_SPI4_MOSI_PORT_ID == 0)
  #define RTE_SPI4_MOSI                 0
#elif  (RTE_SPI4_MOSI_PORT_ID == 1)
  #define RTE_SPI4_MOSI                 1
  #define RTE_SPI4_MOSI_PORT            GPIO_PORT_A
  #define RTE_SPI4_MOSI_PIN             GPIO_PIN_1
  #define RTE_SPI4_MOSI_FUNC            GPIO_PIN_FUNC_5
#elif  (RTE_SPI4_MOSI_PORT_ID == 2)
  #define RTE_SPI4_MOSI                 1
  #define RTE_SPI4_MOSI_PORT            GPIO_PORT_E
  #define RTE_SPI4_MOSI_PIN             GPIO_PIN_6
  #define RTE_SPI4_MOSI_FUNC            GPIO_PIN_FUNC_5
#elif  (RTE_SPI4_MOSI_PORT_ID == 3)
  #define RTE_SPI4_MOSI                 1
  #define RTE_SPI4_MOSI_PORT            GPIO_PORT_E
  #define RTE_SPI4_MOSI_PIN             GPIO_PIN_14
  #define RTE_SPI4_MOSI_FUNC            GPIO_PIN_FUNC_5
#else
  #error "Invalid SPI4_MOSI Pin Configuration!"
#endif

//   <o> SPI4_SCK Pin <0=>PB13 <1=>PE2 <2=>PE12
#define RTE_SPI4_SCK_PORT_ID            0
#if    (RTE_SPI4_SCK_PORT_ID == 0)
  #define RTE_SPI4_SCK_PORT             GPIO_PORT_B
  #define RTE_SPI4_SCK_PIN              GPIO_PIN_13

  #if (defined (STM32F413xx) || defined (STM32F423xx))
    #define RTE_SPI4_SCK_FUNC           GPIO_PIN_FUNC_6
  #else
    #define RTE_SPI4_SCK_FUNC           GPIO_PIN_FUNC_5
  #endif

#elif  (RTE_SPI4_SCK_PORT_ID == 1)
  #define RTE_SPI4_SCK_PORT             GPIO_PORT_E
  #define RTE_SPI4_SCK_PIN              GPIO_PIN_2
  #define RTE_SPI4_SCK_FUNC             GPIO_PIN_FUNC_5
#elif  (RTE_SPI4_SCK_PORT_ID == 2)
  #define RTE_SPI4_SCK_PORT             GPIO_PORT_E
  #define RTE_SPI4_SCK_PIN              GPIO_PIN_12
  #define RTE_SPI4_SCK_FUNC             GPIO_PIN_FUNC_5
#else
  #error "Invalid SPI4_SCK Pin Configuration!"
#endif

//   <o> SPI4_NSS Pin <0=>Not Used <1=>PB12 <2=>PE4 <3=>PE11
#define RTE_SPI4_NSS_PORT_ID            0
#if    (RTE_SPI4_NSS_PORT_ID == 0)
  #define RTE_SPI4_NSS                  0
#elif  (RTE_SPI4_NSS_PORT_ID == 1)
  #define RTE_SPI4_NSS                  1
  #define RTE_SPI4_NSS_PORT             GPIO_PORT_B
  #define RTE_SPI4_NSS_PIN              GPIO_PIN_12

  #if (defined (STM32F413xx) || defined (STM32F423xx))
    #define RTE_SPI4_NSS_FUNC           GPIO_PIN_FUNC_6
  #else
    #define RTE_SPI4_NSS_FUNC           GPIO_PIN_FUNC_5
  #endif

#elif  (RTE_SPI4_NSS_PORT_ID == 2)
  #define RTE_SPI4_NSS                  1
  #define RTE_SPI4_NSS_PORT             GPIO_PORT_E
  #define RTE_SPI4_NSS_PIN              GPIO_PIN_4
  #define RTE_SPI4_NSS_FUNC             GPIO_PIN_FUNC_5
#elif  (RTE_SPI4_NSS_PORT_ID == 3)
  #define RTE_SPI4_NSS                  1
  #define RTE_SPI4_NSS_PORT             GPIO_PORT_E
  #define RTE_SPI4_NSS_PIN              GPIO_PIN_11
  #define RTE_SPI4_NSS_FUNC             GPIO_PIN_FUNC_5
#else
  #error "Invalid SPI4_NSS Pin Configuration!"
#endif

//   <e> DMA Rx
//     <o1> Number <2=>2
//     <i>  Selects DMA Number (only DMA2 can be used)
//     <o2> Stream <0=>0 <3=>3 <4=>4
//     <i>  Selects DMA Stream (only Stream 0 or 3 can be used)
//     <o3> Channel <4=>4 <5=>5
//     <i>  Selects DMA Channel (only Channel 4 or 5 can be used)
//     <o4> Priority <0=>Low <1=>Medium <2=>High <3=>Very High
//     <i>  Selects DMA Priority
//   </e>
#define RTE_SPI4_RX_DMA                 0
#define RTE_SPI4_RX_DMA_NUMBER          1
#define RTE_SPI4_RX_DMA_STREAM          0
#define RTE_SPI4_RX_DMA_CHANNEL         0
#define RTE_SPI4_RX_DMA_PRIORITY        0

//   <e> DMA Tx
//     <o1> Number <2=>2
//     <i>  Selects DMA Number (only DMA2 can be used)
//     <o2> Stream <1=>1 <4=>4
//     <i>  Selects DMA Stream (only Stream 1 or 4 can be used)
//     <o3> Channel <4=>4 <5=>5
//     <i>  Selects DMA Channel (only Channel 4 or 5 can be used)
//     <o4> Priority <0=>Low <1=>Medium <2=>High <3=>Very High
//     <i>  Selects DMA Priority
//   </e>
#define RTE_SPI4_TX_DMA                 0
#define RTE_SPI4_TX_DMA_NUMBER          1
#define RTE_SPI4_TX_DMA_STREAM          5
#define RTE_SPI4_TX_DMA_CHANNEL         0
#define RTE_SPI4_TX_DMA_PRIORITY        0

// </e>

// <e> SPI5 (Serial Peripheral Interface 5) [Driver_SPI5]
// <i> Configuration settings for Driver_SPI5 in component ::CMSIS Driver:SPI
#define RTE_SPI5                        0

//   <o> SPI5_MISO Pin <0=>Not Used <1=>PA12 <2=>PE5 <3=>PE13 <4=>PF8 <5=>PH7
#define RTE_SPI5_MISO_PORT_ID           0
#if    (RTE_SPI5_MISO_PORT_ID == 0)
  #define RTE_SPI5_MISO                 0
#elif  (RTE_SPI5_MISO_PORT_ID == 1)
  #define RTE_SPI5_MISO                 1
  #define RTE_SPI5_MISO_PORT            GPIO_PORT_A
  #define RTE_SPI5_MISO_PIN             GPIO_PIN_12

  #if (defined(STM32F410Tx) || defined(STM32F410Cx) || defined(STM32F410Rx) || defined(STM32F413xx) || defined(STM32F423xx))
    #define RTE_SPI5_MISO_FUNC          GPIO_PIN_FUNC_6
  #else
    #define RTE_SPI5_MISO_FUNC          GPIO_PIN_FUNC_5
  #endif
#elif  (RTE_SPI5_MISO_PORT_ID == 2)
  #define RTE_SPI5_MISO                 1
  #define RTE_SPI5_MISO_PORT            GPIO_PORT_E
  #define RTE_SPI5_MISO_PIN             GPIO_PIN_5

  #if (defined(STM32F410Tx) || defined(STM32F410Cx) || defined(STM32F410Rx) || defined(STM32F413xx) || defined(STM32F423xx))
    #define RTE_SPI5_MISO_FUNC          GPIO_PIN_FUNC_6
  #else
    #define RTE_SPI5_MISO_FUNC          GPIO_PIN_FUNC_5
  #endif
#elif  (RTE_SPI5_MISO_PORT_ID == 3)
  #define RTE_SPI5_MISO                 1
  #define RTE_SPI5_MISO_PORT            GPIO_PORT_E
  #define RTE_SPI5_MISO_PIN             GPIO_PIN_13

  #if (defined(STM32F410Tx) || defined(STM32F410Cx) || defined(STM32F410Rx) || defined(STM32F413xx) || defined(STM32F423xx))
    #define RTE_SPI5_MISO_FUNC          GPIO_PIN_FUNC_6
  #else
    #define RTE_SPI5_MISO_FUNC          GPIO_PIN_FUNC_5
  #endif
#elif  (RTE_SPI5_MISO_PORT_ID == 4)
  #define RTE_SPI5_MISO                 1
  #define RTE_SPI5_MISO_PORT            GPIO_PORT_F
  #define RTE_SPI5_MISO_PIN             GPIO_PIN_8

  #if (defined(STM32F410Tx) || defined(STM32F410Cx) || defined(STM32F410Rx) || defined(STM32F413xx) || defined(STM32F423xx))
    #define RTE_SPI5_MISO_FUNC          GPIO_PIN_FUNC_6
  #else
    #define RTE_SPI5_MISO_FUNC          GPIO_PIN_FUNC_5
  #endif
#elif  (RTE_SPI5_MISO_PORT_ID == 5)
  #define RTE_SPI5_MISO                 1
  #define RTE_SPI5_MISO_PORT            GPIO_PORT_H
  #define RTE_SPI5_MISO_PIN             GPIO_PIN_7

  #if (defined(STM32F410Tx) || defined(STM32F410Cx) || defined(STM32F410Rx) || defined(STM32F413xx) || defined(STM32F423xx))
    #define RTE_SPI5_MISO_FUNC          GPIO_PIN_FUNC_6
  #else
    #define RTE_SPI5_MISO_FUNC          GPIO_PIN_FUNC_5
  #endif
#else
  #error "Invalid SPI5_MISO Pin Configuration!"
#endif

//   <o> SPI5_MOSI Pin <0=>Not Used <1=>PA10 <2=>PB8 <3=>PE6 <4=>PE14 <5=>PF9 <6=>PF11
#define RTE_SPI5_MOSI_PORT_ID           0
#if    (RTE_SPI5_MOSI_PORT_ID == 0)
  #define RTE_SPI5_MOSI                 0
#elif  (RTE_SPI5_MOSI_PORT_ID == 1)
  #define RTE_SPI5_MOSI                 1
  #define RTE_SPI5_MOSI_PORT            GPIO_PORT_A
  #define RTE_SPI5_MOSI_PIN             GPIO_PIN_10

  #if (defined(STM32F410Tx) || defined(STM32F410Cx) || defined(STM32F410Rx) || defined(STM32F413xx) || defined(STM32F423xx))
    #define RTE_SPI5_MOSI_FUNC          GPIO_PIN_FUNC_6
  #else
    #define RTE_SPI5_MOSI_FUNC          GPIO_PIN_FUNC_5
  #endif
#elif  (RTE_SPI5_MOSI_PORT_ID == 2)
  #define RTE_SPI5_MOSI                 1
  #define RTE_SPI5_MOSI_PORT            GPIO_PORT_B
  #define RTE_SPI5_MOSI_PIN             GPIO_PIN_8

  #if (defined(STM32F410Tx) || defined(STM32F410Cx) || defined(STM32F410Rx) || defined(STM32F413xx) || defined(STM32F423xx))
    #define RTE_SPI5_MOSI_FUNC          GPIO_PIN_FUNC_6
  #else
    #define RTE_SPI5_MOSI_FUNC          GPIO_PIN_FUNC_5
  #endif
#elif  (RTE_SPI5_MOSI_PORT_ID == 3)
  #define RTE_SPI5_MOSI                 1
  #define RTE_SPI5_MOSI_PORT            GPIO_PORT_E
  #define RTE_SPI5_MOSI_PIN             GPIO_PIN_6

  #if (defined(STM32F410Tx) || defined(STM32F410Cx) || defined(STM32F410Rx) || defined(STM32F413xx) || defined(STM32F423xx))
    #define RTE_SPI5_MOSI_FUNC          GPIO_PIN_FUNC_6
  #else
    #define RTE_SPI5_MOSI_FUNC          GPIO_PIN_FUNC_5
  #endif
#elif  (RTE_SPI5_MOSI_PORT_ID == 4)
  #define RTE_SPI5_MOSI                 1
  #define RTE_SPI5_MOSI_PORT            GPIO_PORT_E
  #define RTE_SPI5_MOSI_PIN             GPIO_PIN_14

  #if (defined(STM32F410Tx) || defined(STM32F410Cx) || defined(STM32F410Rx) || defined(STM32F413xx) || defined(STM32F423xx))
    #define RTE_SPI5_MOSI_FUNC          GPIO_PIN_FUNC_6
  #else
    #define RTE_SPI5_MOSI_FUNC          GPIO_PIN_FUNC_5
  #endif
#elif  (RTE_SPI5_MOSI_PORT_ID == 5)
  #define RTE_SPI5_MOSI                 1
  #define RTE_SPI5_MOSI_PORT            GPIO_PORT_F
  #define RTE_SPI5_MOSI_PIN             GPIO_PIN_9

  #if (defined(STM32F410Tx) || defined(STM32F410Cx) || defined(STM32F410Rx) || defined(STM32F413xx) || defined(STM32F423xx))
    #define RTE_SPI5_MOSI_FUNC          GPIO_PIN_FUNC_6
  #else
    #define RTE_SPI5_MOSI_FUNC          GPIO_PIN_FUNC_5
  #endif
#elif  (RTE_SPI5_MOSI_PORT_ID == 6)
  #define RTE_SPI5_MOSI                 1
  #define RTE_SPI5_MOSI_PORT            GPIO_PORT_F
  #define RTE_SPI5_MOSI_PIN             GPIO_PIN_11

  #if (defined(STM32F410Tx) || defined(STM32F410Cx) || defined(STM32F410Rx) || defined(STM32F413xx) || defined(STM32F423xx))
    #define RTE_SPI5_MOSI_FUNC          GPIO_PIN_FUNC_6
  #else
    #define RTE_SPI5_MOSI_FUNC          GPIO_PIN_FUNC_5
  #endif
#else
  #error "Invalid SPI5_MOSI Pin Configuration!"
#endif

//   <o> SPI5_SCK Pin <0=>PB0 <1=>PE2 <2=>PE12 <3=>PF7 <4=>PH6
#define RTE_SPI5_SCK_PORT_ID            0
#if    (RTE_SPI5_SCK_PORT_ID == 0)
  #define RTE_SPI5_SCK_PORT             GPIO_PORT_B
  #define RTE_SPI5_SCK_PIN              GPIO_PIN_0

  #if (defined(STM32F410Tx) || defined(STM32F410Cx) || defined(STM32F410Rx) || defined(STM32F413xx) || defined(STM32F423xx))
    #define RTE_SPI5_SCK_FUNC           GPIO_PIN_FUNC_6
  #else
    #define RTE_SPI5_SCK_FUNC           GPIO_PIN_FUNC_5
  #endif
#elif  (RTE_SPI5_SCK_PORT_ID == 1)
  #define RTE_SPI5_SCK_PORT             GPIO_PORT_E
  #define RTE_SPI5_SCK_PIN              GPIO_PIN_2

  #if (defined(STM32F410Tx) || defined(STM32F410Cx) || defined(STM32F410Rx) || defined(STM32F413xx) || defined(STM32F423xx))
    #define RTE_SPI5_SCK_FUNC           GPIO_PIN_FUNC_6
  #else
    #define RTE_SPI5_SCK_FUNC           GPIO_PIN_FUNC_5
  #endif
#elif  (RTE_SPI5_SCK_PORT_ID == 2)
  #define RTE_SPI5_SCK_PORT             GPIO_PORT_E
  #define RTE_SPI5_SCK_PIN              GPIO_PIN_12

  #if (defined(STM32F410Tx) || defined(STM32F410Cx) || defined(STM32F410Rx) || defined(STM32F413xx) || defined(STM32F423xx))
    #define RTE_SPI5_SCK_FUNC           GPIO_PIN_FUNC_6
  #else
    #define RTE_SPI5_SCK_FUNC           GPIO_PIN_FUNC_5
  #endif
#elif  (RTE_SPI5_SCK_PORT_ID == 3)
  #define RTE_SPI5_SCK_PORT             GPIO_PORT_F
  #define RTE_SPI5_SCK_PIN              GPIO_PIN_7

  #if (defined(STM32F410Tx) || defined(STM32F410Cx) || defined(STM32F410Rx) || defined(STM32F413xx) || defined(STM32F423xx))
    #define RTE_SPI5_SCK_FUNC           GPIO_PIN_FUNC_6
  #else
    #define RTE_SPI5_SCK_FUNC           GPIO_PIN_FUNC_5
  #endif
#elif  (RTE_SPI5_SCK_PORT_ID == 4)
  #define RTE_SPI5_SCK_PORT             GPIO_PORT_H
  #define RTE_SPI5_SCK_PIN              GPIO_PIN_6

  #if (defined(STM32F410Tx) || defined(STM32F410Cx) || defined(STM32F410Rx) || defined(STM32F413xx) || defined(STM32F423xx))
    #define RTE_SPI5_SCK_FUNC           GPIO_PIN_FUNC_6
  #else
    #define RTE_SPI5_SCK_FUNC           GPIO_PIN_FUNC_5
  #endif
#else
  #error "Invalid SPI5_SCK Pin Configuration!"
#endif

//   <o> SPI5_NSS Pin <0=>Not Used <1=>PB1 <2=>PE4 <3=>PE11 <4=>PF6 <5=>PH5
#define RTE_SPI5_NSS_PORT_ID            0
#if    (RTE_SPI5_NSS_PORT_ID == 0)
  #define RTE_SPI5_NSS                  0
#elif  (RTE_SPI5_NSS_PORT_ID == 1)
  #define RTE_SPI5_NSS                  1
  #define RTE_SPI5_NSS_PORT             GPIO_PORT_B
  #define RTE_SPI5_NSS_PIN              GPIO_PIN_1

  #if (defined(STM32F413xx) || defined(STM32F423xx))
    #define RTE_SPI5_NSS_FUNC           GPIO_PIN_FUNC_6
  #else
    #define RTE_SPI5_NSS_FUNC           GPIO_PIN_FUNC_5
  #endif
#elif  (RTE_SPI5_NSS_PORT_ID == 2)
  #define RTE_SPI5_NSS                  1
  #define RTE_SPI5_NSS_PORT             GPIO_PORT_E
  #define RTE_SPI5_NSS_PIN              GPIO_PIN_4

  #if (defined(STM32F413xx) || defined(STM32F423xx))
    #define RTE_SPI5_NSS_FUNC           GPIO_PIN_FUNC_6
  #else
    #define RTE_SPI5_NSS_FUNC           GPIO_PIN_FUNC_5
  #endif
#elif  (RTE_SPI5_NSS_PORT_ID == 3)
  #define RTE_SPI5_NSS                  1
  #define RTE_SPI5_NSS_PORT             GPIO_PORT_E
  #define RTE_SPI5_NSS_PIN              GPIO_PIN_11

  #if (defined(STM32F413xx) || defined(STM32F423xx))
    #define RTE_SPI5_NSS_FUNC           GPIO_PIN_FUNC_6
  #else
    #define RTE_SPI5_NSS_FUNC           GPIO_PIN_FUNC_5
  #endif
#elif  (RTE_SPI5_NSS_PORT_ID == 4)
  #define RTE_SPI5_NSS                  1
  #define RTE_SPI5_NSS_PORT             GPIO_PORT_F
  #define RTE_SPI5_NSS_PIN              GPIO_PIN_6

  #if (defined(STM32F413xx) || defined(STM32F423xx))
    #define RTE_SPI5_NSS_FUNC           GPIO_PIN_FUNC_6
  #else
    #define RTE_SPI5_NSS_FUNC           GPIO_PIN_FUNC_5
  #endif
#elif  (RTE_SPI5_NSS_PORT_ID == 5)
  #define RTE_SPI5_NSS                  1
  #define RTE_SPI5_NSS_PORT             GPIO_PORT_H
  #define RTE_SPI5_NSS_PIN              GPIO_PIN_5

  #if (defined(STM32F413xx) || defined(STM32F423xx))
    #define RTE_SPI5_NSS_FUNC           GPIO_PIN_FUNC_6
  #else
    #define RTE_SPI5_NSS_FUNC           GPIO_PIN_FUNC_5
  #endif
#else
  #error "Invalid SPI5_NSS Pin Configuration!"
#endif

